# Desafio Semana #1

```js
// Declarar uma variável chamada `myvar`, sem valor.
var myvar;

// Após declarada, atribua o valor 10 à variável `myvar`.
 ****
 myvar = 10;

// Declare uma nova variável chamada `soma`, e adicione uma instrução somando os valores 15 e 8.
*******
var soma 
 function soma(){
... soma = 15 + 8;
... }
undefined
> soma()
undefined
> soma
23

// Atribua à variável `soma` todo o valor dela, somando 1, usando o operador de soma abreviado.
****
var soma = 23
undefined
> soma
23
> soma ++
23
> soma
24
> soma++
24
> soma
25


// Atribua à variável `soma` todo o valor dela, multiplicando por 3, usando o operador de multiplicação abreviado.
****
> var soma =25
undefined
> soma
25
> soma *= 3
75
> soma
75
>




// Qual é o valor da variável `soma` até aqui?
 *****
 soma = 75

// Declare uma variável chamada `souninja`, atribuindo à ela o valor booleano que representa `verdadeiro`.
******
> var souninja = 1
undefined
> souninja
1
> souninja >= 1
true

// Declare uma variável chamada `comida` que recebe um array com os valores 'arroz', 'feijão' e 'ovo'.
*****
> comida=[
... 'arroz',
... 'feijao',
... 'ovo'
... ]
[ 'arroz', 'feijao', 'ovo' ]
> comida
[ 'arroz', 'feijao', 'ovo' ]
>


// Digite a instrução que imprime o valor de 'feijao', que está na variável `comida`.
****
var comida =[]
> comida =['arroz' , 'feijao ' , 'ovo']
[ 'arroz', 'feijao ', 'ovo' ]
> comida[1]
'feijao '
>



// Digite o código que verifica se a variável `soma' é igual a variável `myvar` (testando também o tipo).

> var soma,myvar
undefined
> soma = 75
1
> myvar = 10
2
> soma <= myvar
false
> myvar <= soma
true
>
// Digite o código que verifica se a variável `myvar` é menor ou igual à variável `soma`.

myvar <= soma

// Crie uma função chamada `divisao` que receba como parâmetro dois números, e retorne o resultado da divisão entre eles.
> var divisao
undefined
> divisao =[
... 2,
... 6,
... ]
[ 2, 6 ]
>
> divisao[0] / divisao[1]
0.3333333333333333
>


// Invoque a função criada acima, passando os parâmetros 10 e 2.
> divisao =[
... 10,
... 2,
... ]
[ 10, 2 ]
> divisao[0] / divisao[1]
5
>

```
